[
  {
    "id": 1,
    "key": "vqukRXpML31Q",
    "title": "The Beginnings",
    "date": "March 07, 2025",
    "excerpt": "Kicking off the Interstellar Guide journey! From initial Figma mockups to tackling Cupertino widgets and Shared Preferences, today was all about learning, experimenting, and pushing boundaries. Excited to see where this adventure leads!",
    "content": "Today is the day it all begins. I started by creating a few Figma mockups for the app. I have a few ideas in mind, but I want to keep it simple and clean. My focus is on the content, ensuring it is easy to read and navigate. I'm excited to see where this journey takes me.\n\n{{figmamockups}}\n\nI decided to start building, and a few minutes in, I challenged myself to use Cupertino widgets for the entire app. This turned out to be a bit regretful since there was a lack of documentation and examples for them. I had to figure everything out and rely on my knowledge of Material Design, as there were some parallels.\n\nThe first thing I did was create all the possible files I thought I would need. This helps me split up the code neatly and get a sense of how everything will come together.\n\nIt's been a few hours, and now I'm starting to get the hang of it. I decided to tackle the Shared Preferences requirement, which will handle saving user data. It now takes care of logging in and out as well as saving and parsing favorites.\n\nNow that I have the basic save/load functionality, I can start working on the UI for the login/register screens. This made me think about routing, which hasn't been covered in class yet. Stack Overflow came through with a solution, and I used a router suggested by NiklasPor. Stack Overflow link to the article: [click here](https://stackoverflow.com/questions/51663793/how-to-use-cupertinopageroute-and-named-routes-in-flutter 'Stack Overflow').\n\nI think I made decent progress today. I took a break and decided to work on this again since it was actually fun. I revamped the login and register UI in the settings screen. I remember seeing a native login/register screen that I'm trying to recreate from memory, but this seems to be as close as I can get to how I remember it looking.",
    "images": [
      {
        "key": "figmamockups",
        "src": "/mockups.png",
        "alt": "Early Figma rendering of the app",
        "width": 500
      }
    ]
  },
  {
    "id": 2,
    "key": "2Z4J6J8uZyVR",
    "title": "2",
    "date": "March 08, 2025",
    "excerpt": "2",
    "content": "2",
    "images": []
  },
  {
    "id": 3,
    "key": "rhhuJaD1eDo7",
    "title": "3",
    "date": "March 09, 2025",
    "excerpt": "3",
    "content": "3",
    "images": []
  },
  {
    "id": 4,
    "key": "OBCOwlsoqH35",
    "title": "4",
    "date": "March 22, 2025",
    "excerpt": "4",
    "content": "4",
    "images": []
  },
  {
    "id": 5,
    "key": "seHEgdgl6eok",
    "title": "5",
    "date": "March 27, 2025",
    "excerpt": "5",
    "content": "5",
    "images": []
  },
  {
    "id": 6,
    "key": "wjC2lLQU2L4y",
    "title": "6",
    "date": "March 29, 2025",
    "excerpt": "6",
    "content": "6",
    "images": []
  },
  {
    "id": 7,
    "key": "Bo4hJXWvVv6I",
    "title": "7",
    "date": "March 30, 2025",
    "excerpt": "7",
    "content": "7",
    "images": []
  }
]